---
kind: method
id: M:Autodesk.Revit.DB.OpenOptions.Dispose
source: html/083ebef8-24ba-5485-1ee3-d7e8f94977d8.htm
---
# Autodesk.Revit.DB.OpenOptions.Dispose Method

Releases all resources used by the OpenOptions

## Syntax (C#)
```csharp
public void Dispose()
```